package com.zkkj.gps.gateway.jt808tcp.monitor.jt808.common;

/**
 * 消息ID
 * @author suibozhuliu
 */
public interface MessageId {

    /** 1.终端通用应答 */
    int 终端通用应答 = 0x0001;
    /** 2.平台通用应答 */
    int 平台通用应答 = 0x8001;
    /** 3.终端心跳 */
    int 终端心跳 = 0x0002;
    /** 4.补传分包请求 */
    int 补传分包请求 = 0x8003;
    /** 5.终端注册 */
    int 终端注册 = 0x0100;
    /** 6.终端注册应答 */
    int 终端注册应答 = 0x8100;
    /** 7.终端注销 */
    int 终端注销 = 0x0003;
    /** 8.终端鉴权 */
    int 终端鉴权 = 0x0102;
    /** 9.设置终端参数 */
    int 设置终端参数 = 0x8103;
    /** 10.查询终端参数 */
    int 查询终端参数 = 0x8104;
    /** 11.查询终端参数应答 */
    int 查询终端参数应答 = 0x0104;
    /** 13.查询指定终端参数 */
    int 查询指定终端参数 = 0x8106;
    /** 14.查询终端属性 */
    int 查询终端属性 = 0x8107;
    /** 15.查询终端属性应答 */
    int 查询终端属性应答 = 0x0107;
    /** 18.位置信息汇报 */
    int 位置信息汇报 = 0x0200;
    /** 19.位置信息查询 */
    int 位置信息查询 = 0x8201;
    /** 20.位置信息查询应答 */
    int 位置信息查询应答 = 0x0201;
    /** 34.车辆控制应答 */
    int 车辆控制应答 = 0x0500;
    /** 46.电子运单上报 */
    int 电子运单上报 = 0x0701;
    /** 49.定位数据批量上传 */
    int 定位数据批量上传 = 0x0704;
    /** 61.数据下行透传 */
    int 数据下行透传 = 0x8900;
    /** 62.数据上行透传 */
    int 数据上行透传 = 0x0900;

}